In [5]:
import pandas as pd
from pathlib import Path
from datetime import datetime

In [6]:
raw_data_dir = Path.cwd() / "data" / "raw"
clean_data_dir = Path.cwd() / "data" / "clean"

#Â Taylor Rule

In [7]:
time_span = [year for year in range(1980, 2003)]

### Interest Rates

(OECD)

In [22]:
df = pd.read_csv(
    raw_data_dir / "ST_interestrate_1980-2002.csv",
    sep=";",  
    dtype={"year": int, "interest_rate": float}
)

In [24]:
df = df.rename(columns={"Year": "year", "Interest Rate": "interest_rate"})

In [25]:
df = df.loc[df["year"].isin(time_span)]

In [28]:
df.head()

   year interest_rate
0  1980         16,79
1  1981         19,23
2  1982         19,91
3  1983         18,31
4  1984         17,27

In [29]:
df.to_csv(clean_data_dir / "interest_rate.csv", sep="\t", index=False)

### Inflation

(WWW.RIVALUTA.it)

In [33]:
df = pd.read_csv(
    raw_data_dir / "datiinflazionemediaitalia.csv", 
    sep=";",  
)

In [35]:
df = df[1:-1]

In [37]:
df = df.rename(columns={"WWW.RIVALUTA.it": "inflation_rate"})

In [38]:
df.reset_index(col_level=0, names="year", inplace=True)

In [39]:
df = df.sort_values("year")

In [42]:
df["year"] = df["year"].astype(int)

In [45]:
df = df.loc[df["year"].isin(time_span)]

In [46]:
df.head()

    year inflation_rate
43  1980          21,2%
42  1981          17,8%
41  1982          16,5%
40  1983          14,7%
39  1984          10,8%

In [47]:
df.to_csv(clean_data_dir / "inflation_rate.csv", sep="\t", index=False)

### Gdp

(Macrotrends)

In [48]:
df = pd.read_csv(
    raw_data_dir / "italy-gdp-gross-domestic-product.csv",
    sep=",",
    usecols=["date", "GDP ( Billions of US $)"],
)

In [49]:
df = df.rename(columns={"GDP ( Billions of US $)": "gdp"})

In [50]:
def date_to_year(date):
    date_object = datetime.strptime(date, "%Y-%m-%d")
    year = date_object.year
    return year

In [51]:
df["year"] = df["date"].apply(lambda x: date_to_year(x))
df.drop("date", axis=1, inplace=True)

In [52]:
df = df[["year", "gdp"]]

In [54]:
df = df.loc[df["year"].isin(time_span)]

In [55]:
df.head()

    year         gdp
20  1980  477.256776
21  1981  430.702851
22  1982  427.272646
23  1983  443.042374
24  1984  437.887689

In [56]:
df.to_csv(clean_data_dir / "gdp.csv", sep="\t", index=False)

### Output Gap

(Nasdaq)

In [57]:
df = pd.read_csv(
    raw_data_dir / "nasdaq_output_gap.csv",
    sep=",",
)

In [58]:
df = df.rename(columns={"Value": "output_gap"})

In [59]:
df["year"] = df["Date"].apply(lambda x: date_to_year(x))
df.drop("Date", axis=1, inplace=True)

In [60]:
df = df[["year", "output_gap"]]

In [61]:
df = df.sort_values("year")

In [64]:
df = df.loc[df["year"].isin(time_span)]

In [65]:
df.head()

    year  output_gap
44  1980      12.396
43  1981      -0.922
42  1982      -2.350
41  1983      -3.552
40  1984      -2.860

In [66]:
df.to_csv(clean_data_dir / "output_gap.csv", sep="\t", index=False)

# Additional Regressors

### Unemployment

(FRED)

In [67]:
df = pd.read_csv(
    raw_data_dir / "LRHUTTTTITA156S.csv",
    sep=",",
)

In [68]:
df = df.rename(columns={"DATE": "year", "LRHUTTTTITA156S": "unemployment_rate"})

In [70]:
df["year"] = df["year"].apply(lambda x: date_to_year(x))

In [73]:
df = df.loc[df["year"].isin(time_span)]

In [74]:
df.head()

   year  unemployment_rate
0  1982           7.166667
1  1983           7.366667
2  1984           7.833333
3  1985           8.141667
4  1986           8.883333

In [75]:
df.to_csv(clean_data_dir / "unemployment_rate.csv", sep="\t", index=False)

### Exchange Rate

In [104]:
df = pd.read_csv(
    raw_data_dir / "USD_serie_storica_giornaliera .csv",
    sep=",",
    usecols=["Data di Riferimento", "Quotazione"]
)

In [105]:
df = df.rename(columns={"Data di Riferimento": "year", "Quotazione": "exchange_rate"})

In [107]:
df = df.sort_values("year")

In [108]:
df["year"] = df["year"].apply(lambda x: date_to_year(x))

In [111]:
df = df.drop_duplicates(keep='last')

In [113]:
df = df.loc[df["year"].isin(time_span)]

In [114]:
df.head()

   year  exchange_rate
0  1980         801.25
1  1980         799.50
2  1980         803.00
4  1980         803.50
5  1980         801.00

In [115]:
df.to_csv(clean_data_dir / "exchange_rate.csv", sep="\t", index=False)

### Foreign Interest Rate

In [77]:
df = pd.read_csv(
    raw_data_dir / "US10y_bond.csv",
    sep=",",
)

In [83]:
df = df.rename(columns={"YEAR": "year", "Value": "US_interest_rate"})

In [84]:
df = df.loc[df["year"].isin(time_span)]

In [85]:
df.head()

    year  US_interest_rate
20  1980         11.460000
21  1981         13.910833
22  1982         13.001667
23  1983         11.105000
24  1984         12.438333

In [30]:
df.to_csv(clean_data_dir / "us_bond_yield.csv", sep="\t", index=False)